Tekla Open API Reference for Tekla Structures 2025
AnalysisSupport.Spring Property
 The spring values of the connectivity.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public double[] Spring { get; set; }
Public Property Spring As Double()
	Get
	Set
Property Value
Type: Double[]
See Also
Reference
AnalysisSupport Class
Tekla.Structures.Analysis Namespace